{
  "Breakdowns": [
    {
      "Name": "Flat Tires / Punctures",
      "In Cars": {
        "Tools Required": [
          "Spare tire",
          "Jack",
          "Wheel spanner",
          "Warning triangle"
        ],
        "Steps": [
          "Park the car safely off the road and turn on hazard lights.",
          "Place the warning triangle 30-40m behind your car for safety.",
          "Loosen the wheel nuts slightly (do not remove yet).",
          "Place the jack under the car at the lifting point and raise it until the tire is off the ground.",
          "Remove the loosened nuts fully and take off the flat tire.",
          "Mount the spare tire and tighten nuts with your hand.",
          "Lower the jack and tighten nuts fully in a criss-cross pattern.",
          "Store tools and flat tire in trunk, continue driving safely."
        ],
        "Images": {
          "t1": "assets/images/selfHelp/t1.png",
          "jackCar": "assets/images/selfHelp/jackCar.png",
          "flatTyre": "assets/images/selfHelp/flat-tyreCar.png",
          "carSpanner": "assets/images/selfHelp/carSapnner.png",
          "triangleCar": "assets/images/selfHelp/Trainglecar.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "Puncture kit",
          "Spare tube",
          "Tire lever",
          "Hand pump"
        ],
        "Steps": [
          "Put bike on main stand. Remove the wheel (front or rear).",
          "Use tire lever to open one side of the tire.",
          "Remove the tube and find puncture (inflate & listen/feel air).",
          "If small hole, use patch kit; if big tear, replace tube.",
          "Put tube back, fit tire properly, inflate with pump.",
          "Refit wheel and test ride slowly."
        ],
        "Images": {
          "flatTyrebike": "assets/images/selfHelp/t2.png",
          "punturekitBike": "assets/images/selfHelp/B-kit.png",
          "bikeSpareTube": "assets/images/selfHelp/b-tube.png",
          "bikeHandpump": "assets/images/selfHelp/bPump.png"
        }
      } 
    },
    {
      "Name": "Battery Failure / Dead Battery",
      "In Cars": {
        "Tools Required": [
          "Jumper cables",
          "Another car with good battery"
        ],
        "Steps": [
          "Park the assisting car close, turn both ignitions OFF.",
          "Connect red jumper cable to dead battery's +ve terminal, then to good battery's +ve terminal.",
          "Connect black cable to good battery's -ve terminal, and the other end to car body (metal ground) of dead car.",
          "Start the working car, let it run for 2-3 minutes.",
          "Try starting your car. Once it starts, remove cables in reverse order.",
          "Drive for at least 15-20 mins to recharge."
        ],
        "Images": {
          "carBattery": "assets/images/selfHelp/carDeadbattery.png",
          "batteryshare": "assets/images/selfHelp/carBatteryshare.png",
          "jumperCablesCar": "assets/images/selfHelp/carJumpercable.png"
        }
      },
    
      "In Bikes": {
        "Tools Required": [
          "Portable battery booster",
          "Jumper cables"
        ],
        "Steps": [
          "Switch ignition OFF.",
          "Connect red cable to dead battery +ve, then to donor bike +ve.",
          "Connect black cable to donor -ve terminal, then to dead bike frame.",
          "Start donor bike, then try starting your bike.",
          "Once started, disconnect cables carefully and ride to recharge."
        ],
        "Images": {
          "defectedbatteryBike": "assets/images/selfHelp/B_batteryFailure.png",
          "BikebatteryBooster": "assets/images/selfHelp/B_batteryBooster.png",
          "bikejumperCable": "assets/images/selfHelp/B_jumperCable.png"
        }
      }
    },
    {
      "Name": "Engine Overheating",
      "In Cars": {
        "Tools Required": [
          "Gloves",
          "Water/coolant",
          "Cloth"
        ],
        "Steps": [
          "Stop car immediately, switch off engine. Do NOT open radiator cap while hot.",
          "Wait 15-20 minutes until engine cools down.",
          "Open bonnet and check coolant reservoir.",
          "If low, add coolant or water up to the required level.",
          "Check for visible leaks in radiator or hoses.",
          "Restart gently, drive to nearest workshop."
        ],
        "Images": {
          "carengine": "assets/images/selfHelp/carengineoverhea.png",
          "heat": "assets/images/selfHelp/carHeat.png",
          "carCoolant": "assets/images/selfHelp/carCoolant.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "Stop in shade, turn off engine.",
          "Check oil level; refill if low.",
          "Inspect air-cooling fins , clean properly if blocked with mud/dust.",
          "Avoid high revving; ride slowly to nearest mechanic.",
          "If still overheating, do not ride further, instead tow bike."
        ],
        "Images": {
          "BikeEngine": "assets/images/selfHelp/bikeOverheat.png",
          "bikecoolant": "assets/images/selfHelp/b_coolant.png",
          "bikeoverheat": "assets/images/selfHelp/B_overheat.png"
        }
      }
    },
    {
      "Name": "Brake Failure / Weak Brakes",
      "In Cars": {
        "Tools Required": [
          "Brake fluid",
          "Wrench"
        ],
        "Steps": [
          "If brakes fail while driving, pump pedal repeatedly to build pressure.",
          "Downshift to lower gear, use handbrake gradually.",
          "Pull over safely.",
          "Check brake fluid reservoir; refill if empty.",
          "Inspect under car for fluid leaks.",
          "If brake pads worn out, get replaced at workshop."
        ],
        "Images": {
          
          "carBrakefailure": "assets/images/selfHelp/C_brakefailure.png",
          "carBrakeFluid": "assets/images/selfHelp/carBrakefluid.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "If brakes weak, use engine braking by downshifting.",
          "Check brake cable (for drum) or fluid (for disc).",
          "Tighten cable or refill fluid if needed.",
          "Replace brake pads/shoes if worn out.",
          "Avoid riding until brakes feel firm."
        ],
        "Images": {
          "bikeBrakefailure": "assets/images/selfHelp/B_brakeFailure.png",
          "BikeBrakepad": "assets/images/selfHelp/B_brakePad.png"
          
        }
      }
    },
    {
      "Name": "Electrical Wiring Issues",
      "In Cars": {
        "Tools Required": [
          "Spare fuses",
          "Tape",
          "Basic toolkit"
        ],
        "Steps": [
          "If headlights/indicators fail, check fuse box. Replace blown fuse.",
          "Inspect wiring for loose connections near battery/ECU.",
          "Use electrical tape to cover exposed wires.",
          "If lights still fail, use hazard lights and drive to service."
        ],
        "Images": {
          "carWiring": "assets/images/selfHelp/carWiring.png",
          "carFuses": "assets/images/selfHelp/carFuses.png",
          
          "carToolkit": "assets/images/selfHelp/carToolkit.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "Check battery connection and ignition wiring.",
          "Tighten any loose connectors.",
          "Replace small blown fuse (if equipped).",
          "If lights/ignition still fail, push start bike temporarily."
        ],
        "Images": {
          "BikeWiring": "assets/images/selfHelp/b_wiring.png",
          "BikeFuses": "assets/images/selfHelp/b_fuses.png"
          
        }
      }
    },
    {
      "Name": "Fuel Leakage",
      "In Cars": {
        "Tools Required": [
          "Fuel can (5–10 liters)",
          "Funnel",
          "Cloth / Tissue (to wipe spills)"
        ],
        "Steps": [
          "If your car suddenly stops or stutters, first check the fuel gauge on the dashboard.",
          "Step outside and visually inspect under the car — if you see wet patches or smell strong petrol/diesel, suspect a leakage.",
          "If the fuel tank is simply empty (no leakage), fetch fuel in a safe-approved container (fuel can) from the nearest station.",
          "Open the fuel cap carefully, and place the funnel to avoid spillage.",
          "Pour the fuel slowly into the tank and tighten the cap securely.",
          "Wipe any spills with a cloth before starting the car.",
          "If leakage is detected from the tank or pipes, do not attempt to start the vehicle — call roadside assistance immediately, as there is a fire hazard."
        ],
        "Images": {
          "carFuelLeak": "assets/images/selfHelp/C_FuelLeak.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "1–2 liter fuel bottle",
          "Small funnel",
          "Tape (for minor leaks)"
        ],
        "Steps": [
          "If the bike stalls, check whether the fuel tap is in ON or RESERVE position.",
          "Inspect the fuel pipe — if cracked or dripping, use tape as a temporary fix.",
          "If the tank is empty, arrange fuel in a plastic or metal bottle (safely stored).",
          "Pour petrol using a small funnel into the bike’s fuel tank.",
          "Secure the cap tightly, and wipe away spills.",
          "Ride slowly to the nearest petrol station or mechanic for a permanent fix if leakage exists."
        ],
        "Images": {
          "bikeFuelLeak": "assets/images/selfHelp/B_Fuel.png"
        }
      }
    },
    {
      "Name": "Clutch Failure",
      "In Cars": {
        "Tools Required": [
          "Brake fluid (for hydraulic systems)",
          "Basic toolkit"
        ],
        "Steps": [
          "If pressing the clutch pedal feels unusually soft, spongy, or it doesn’t return, safely pull over immediately.",
          "Check under the dashboard and in the engine bay for any obvious fluid leaks.",
          "Locate the clutch fluid reservoir (usually near the brake master cylinder).",
          "If it is low or empty, carefully top it up with brake fluid (as a temporary fix).",
          "If your car has a cable clutch and the cable snaps, you cannot engage gears normally — call for towing.",
          "If clutch partially works after fluid top-up, engage gears gently and drive only to the nearest mechanic."
        ],
        "Images": {
          "carClutch": "assets/images/selfHelp/C_clutch.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "If clutch lever feels loose or unresponsive, check the clutch cable near the lever.",
          "Sometimes, the cable end slips out of its slot — reattach it carefully if intact.",
          "If the cable has snapped, replace it with a spare cable (many riders carry one).",
          "Without a spare, you can push-start the bike in neutral and ride slowly without using the clutch.",
          "Shift gears carefully by matching throttle and engine speed (clutchless shifting)."
        ],
        "Images": {
          "bikeClutch": "assets/images/selfHelp/B_Clutch.png"
        }
      }
    },
    {
      "Name": "Starter Motor Failure",
      "In Cars": {
        "Tools Required": [
          "Hammer or wrench (for tapping)",
          "Jumper cables"
        ],
        "Steps": [
          "If you turn the key and hear a click but the engine doesn’t crank, check that the battery is fully charged.",
          "If the battery is good, suspect the starter motor is stuck.",
          "Locate the starter motor (usually near the bottom of the engine).",
          "Use a hammer or wrench to gently tap the starter while another person turns the key — this can unjam it temporarily.",
          "If this doesn’t work, try using jumper cables with another vehicle to rule out weak battery supply.",
          "If still unresponsive, call roadside assistance — do not keep cranking as it may drain the battery."
        ],
        "Images": {
          "carStarter": "assets/images/selfHelp/C_motor.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "If pressing the starter button does nothing, check if the battery is charged.",
          "Try using the kick-starter (if available).",
          "If the kick works but the button doesn’t, check the starter relay and wiring.",
          "If the starter motor is jammed, push-start the bike in 2nd gear with clutch released suddenly.",
          "If the starter is burnt out, it must be replaced at a workshop."
        ],
        "Images": {
          "bikeStarter": "assets/images/selfHelp/B_motor.png"
        }
      }
    },
    {
      "Name": "Indicator Failure",
      "In Cars": {
        "Tools Required": [
          "Spare bulbs",
          "Fuse kit",
          "Screwdriver"
        ],
        "Steps": [
          "If headlights or indicators stop working suddenly, first check if multiple lights are affected — this usually indicates a blown fuse.",
          "Locate the fuse box (often under dashboard or bonnet).",
          "Replace the blown fuse with one of the same rating.",
          "If only one bulb is fused, replace it by removing the light cover with a screwdriver and inserting a spare bulb.",
          "If wiring is loose or exposed, temporarily secure it with tape.",
          "Until fixed, use hazard lights and drive slowly."
        ],
        "Images": {
          "carHeadlight": "assets/images/selfHelp/C_indicator.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "If the headlight doesn’t turn on, check the bulb by opening the headlamp housing.",
          "Replace the fused bulb if you have a spare.",
          "Inspect the small fuse under the seat or near the battery (if present).",
          "If indicators fail, check the relay and connections inside the headlamp casing.",
          "If unable to fix roadside, use hand signals and avoid night riding until repaired."
        ],
        "Images": {
          "bikeHeadlight": "assets/images/selfHelp/B_indicator.png"
        }
      }
    }

  ]
}
