{
  "Breakdowns": [
    {
      "Name": "پنکچر / ٹائر لیک",
      "In Cars": {
        "Tools Required": [
          "اضافی ٹائر",
          "جیک",
          "وہیل سپینر",
          "وارننگ ٹرائی اینگل"
        ],
        "Steps": [
          "ٹریفک توں دور اک ہموار، مستحکم جگہ تے گڈی نوں احتیاط نال کھڑا کرو تے دوجے ڈرائیوراں نوں خبردار کرن لئی فوراً اپنی ہیزرڈ لائٹاں آن کرو۔",
          "اپنی گڈی دے پِچھے 30-40 میٹر دور جا کے سڑک اُتے وارننگ ٹرائی اینگل رکھو تاکہ تہاڈے مرمت دے کم لئی اک محفوظ علاقہ بݨایا جا سکے۔",
          "وہیل سپینر دی ورتوں کردے ہوئے، پہیے دے نٹاں نوں الٹی گھڑی دی دیشا وچ گھما کے ڈھیلا کرو، لیکن ایس مرحلے اُتے اونہاں نوں پوری طرحاں نہ ہٹاؤ۔",
          "کار دے جیک نوں فلیٹ ٹائر دے نیڑے گڈی دے مقررہ چکن والے پوائنٹ دے تھلے رکھو تے کار نوں آہستہ آہستہ اُپر چکو ایتھوں تائیں جو ٹائر زمین توں پوری طرحاں اُپر نہ ہو جائے۔",
          "ہُن سارے ڈھیلے وہیل نٹ پوری طرحاں ہٹا دیو تے فلیٹ ٹائر نوں پہیے دے سٹڈز توں سیدھا احتیاط نال لاہو، ایہنوں متوازن رکھدے ہوئے۔",
          "سپیئر ٹائر نوں وہیل سٹڈز دے نال سیدھا کرو تے ایہنوں اپنی تھاں اُتے دھکیلو، فیر سارے نٹاں نوں ہتھاں نال تارے دے پیٹرن وچ کَسو تاکہ برابر بیٹھن نوں یقینی بݨایا جا سکے۔",
          "جیک نوں اودوں تائیں تھلے کرو جدوں تک ٹائر زمین نوں چھون نہ لگ جائے، فیر وہیل سپینر دی ورتوں کردے ہوئے زیادہ توں زیادہ حفاظت لئی نٹاں نوں کراس پیٹرن وچ پوری طرحاں کَسو۔",
          "سارے اوزار تے فلیٹ ٹائر نوں اپنی ڈِگی وچ احتیاط نال رکھو، فیر نقصان زدہ ٹائر نوں ٹھیک کرن یا تبدیل کرن لئی احتیاط نال نیڑے دے مکینک دی دکان تے جاؤ۔"
        ],
        "Images": {
          "flatTyre": "assets/images/selfHelp/flat-tyreCar.png",
          "jackCar": "assets/images/selfHelp/jackCar.png",
          "carSpanner": "assets/images/selfHelp/carSapnner.png",
          "triangleCar": "assets/images/selfHelp/Trainglecar.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "پنکچر کِٹ",
          "اضافی ٹِیوب",
          "ٹائر لیور",
          "ہتھ والا پمپ"
        ],
        "Steps": [
          "اپنی بائیک نوں اوہدے مین سٹینڈ یا سینٹر سٹینڈ اُتے مضبوطی نال کھڑا کرو، فیر ایہہ ویکھدے ہوئے کہ کیہڑا ٹائر پنکچر اے، اگلا یا پچھلا پہیہ ہٹاؤ۔",
          "ٹائر لیور نوں ٹائر تے رم دے وچکار پاؤ، فیر احتیاط نال ٹائر دے اک پاسے نوں رم دے کنارے توں اُپر چکّو، پورے گھیر دے دوالے کم کردے ہوئے ۔",
          "اندرونی ٹِیوب نوں پوری طرحاں باہر کڈھو، فیر ایہنوں تھوڑا جہیا پھلاؤ تے سِس دی آواز سنن لئی یا ہوا دے نکلن نوں محسوس کرن لئی احتیاط نال سنو تاکہ پنکچر دا پتا لگایا جا سکے۔",
          "چھوٹے سوراخاں لئی، پنکچر دے دوالے والے علاقے نوں رگڑائی والے کاغذ نال رگڑو، ربڑ سیمنٹ لاؤ، تے پیچ نوں مضبوطی نال دباؤ؛ وڈیاں پھٹیاں لئی، اک نویں ٹِیوب لگاؤ۔",
          "مرمت شدہ یا نویں ٹِیوب نوں احتیاط نال ٹائر دے اندر واپس رکھو، یقینی بݨاؤ کہ ایہہ مُڑیا ہویا نہیں، فیر اپنے ہتھاں تے لیورز دی ورتوں کردے ہوئے ٹائر دے بید نوں دوبارہ رم اُتے واپس بٹھاؤ۔",
          "ہتھ والے پمپ دی ورتوں کردے ہوئے ٹائر نوں تجویز کردہ دباؤ اُتے پھلاؤ، پہیے نوں دوبارہ بائیک اُتے لاؤ، تے مرمت دے ٹھیک رہن دی تصدیق لئی ہولی ٹیسٹ رائیڈ کرو۔"
        ],
        "Images": {
          "flatTyrebike": "assets/images/selfHelp/t2.png",
          "punturekitBike": "assets/images/selfHelp/B-kit.png",
          "bikeSpareTube": "assets/images/selfHelp/b-tube.png",
          "bikeHandpump": "assets/images/selfHelp/bPump.png"
        }
      }
    },
    {
      "Name": "بیٹری خراب / ڈیڈ بیٹری",
      "In Cars": {
        "Tools Required": [
          "جمپر کیبلز",
          "چنگی بیٹری والی دوجی کار"
        ],
        "Steps": [
          "مددگار گڈی نوں اینا نیڑے کھڑا کرو کہ جمپر کیبلز دوہاں بیٹریاں تک پہنچ سکن، لیکن یقینی بݨاؤ کہ کاراں آپس وچ نہ لگن، فیر دوہاں دیاں اِگنیشن پوری طرحاں بند کر دیو۔",
          "اک لال کلیمپ نوں اپنی ڈیڈ بیٹری دے مثبت (+) ٹرمینل نال جوڑو، فیر دوجے لال کلیمپ نوں چنگی بیٹری دے مثبت ٹرمینل نال لاؤ۔",
          "اک کالی کلیمپ نوں چنگی بیٹری دے منفی (-) ٹرمینل نال جوڑو، فیر آخری کالی کلیمپ نوں اپنی کار دے انجن بلاک اُتے اک غیر-پینٹ شدہ دھاتی سطح نال لاؤ۔",
          "چلدی گڈی دا انجن سٹارٹ کرو تے ایہنوں 2-3 منٹ تک درمیانی رفتار اُتے چلدن دیو تاکہ تہاڈی ڈیڈ بیٹری وچ کجھ چارج منتقل ہو سکے۔",
          "اپنی کار نوں سٹارٹ کرن دی کوشش کرو - جے ایہہ کامیابی نال سٹارٹ ہو جاندی اے، تے کیبلز نوں جوڑن دے الٹ ترتیب وچ احتیاط نال ہٹاؤن توں پہلاں دوہاں گڈیاں نوں ہور اک منٹ تک چلدن دیو۔",
          "اپنی گڈی نوں گھٹو گھٹ 15-20 منٹ تک لگاتار چلاؤ تاکہ آلٹرنیٹر بیٹری نوں دوبارہ پوری طرحاں چارج کر سکے، فیر انجن نوں دوبارہ بند کرو۔"
        ],
        "Images": {
          "carBattery": "assets/images/selfHelp/carDeadbattery.png",
          "batteryshare": "assets/images/selfHelp/carBatteryshare.png",
          "jumperCablesCar": "assets/images/selfHelp/carJumpercable.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "پورٹیبل بیٹری بوسٹر",
          "جمپر کیبلز"
        ],
        "Steps": [
          "یقینی بݨاؤ کہ حفاظت لئی بیٹری کنکشن دے طریقہ کار شروع کرن توں پہلاں دوہاں بائیکاں نیوٹرل وچ ہون تے اِگنیشن سوئچ پوری طرحاں بند ہون۔",
          "پہلاں لال جمپر کیبل نوں اپنی ڈیڈ بیٹری دے مثبت ٹرمینل نال جوڑو، فیر دوجے لال سرے نوں دوجی بائیک دے مثبت ٹرمینل نال لاؤ۔",
          "کالی کیبل نوں دوجی بائیک دی بیٹری دے منفی ٹرمینل نال لاؤ، فیر آخری کالی کلیمپ نوں اپنی بائیک دے فریم یا انجن دے دھاتی حصے نال جوڑو۔",
          "مدد دین والی بائیک دا انجن سٹارٹ کرو تے ایہنوں اک منٹ تک چلدن دیو، فیر ضرورت پین تے تھوڑا جہیا تھراٹل دیندے ہوئے اپنی بائیک سٹارٹ کرن دی کوشش کرو۔",
          "جدوں تہاڈی بائیک کامیابی نال سٹارٹ ہو جائے، تے کیبلز نوں احتیاط نال الٹ ترتیب وچ ہٹاؤ، فیر بیٹری نوں چنگی طرحاں ریچارج کرن لئی گھٹو گھٹ 30 منٹ تک رائیڈ کرو۔"
        ],
        "Images": {
          "defectedbatteryBike": "assets/images/selfHelp/B_batteryFailure.png",
          "BikebatteryBooster": "assets/images/selfHelp/B_batteryBooster.png",
          "bikejumperCable": "assets/images/selfHelp/B_jumperCable.png"
        }
      }
    },
    {
      "Name": "انجن دا اوورہیٹ ہونا",
      "In Cars": {
        "Tools Required": [
          "دستانے",
          "پانی/کولنٹ",
          "کپڑا"
        ],
        "Steps": [
          "فوراً اک محفوظ جگہ اُتے گڈی نوں کھڑا کرو تے انجن نوں پوری طرحاں بند کر دیو – انجن دے گرم ہوندے ہوئے ریڈیئیٹر دا ڈھکن کھولن دی کوشش کدی نہ کرو۔",
          "15-20 منٹ تک صبر نال انتظار کرو تاکہ انجن کافی ٹھنڈا ہو جائے ایس توں پہلاں جو کسے کولنگ سسٹم دے حصے نوں چیک کرن یا چھون دی کوشش کرو۔",
          "حفاظت لئی دستانے پاؤ، فیر احتیاط نال ہڈ کھولو تے کولنٹ ریزروائر لبھو، گھٹو گھٹ تے زیادہ توں زیادہ نشانات دے مطابق فلوئڈ لیول چیک کرو۔",
          "جے کولنٹ گھٹ ہووے، تے آہستہ آہستہ کولنٹ تے پانی دا 50/50 مکسچر پاؤ جدوں تک ایہہ زیادہ توں زیادہ بھرن والی لائن تک نہ پہنچ جائے، ریزروائر نوں زیادہ نہ بھرن دا خیال رکھو۔",
          "ریڈیئیٹر، ہوزز تے واٹر پمپ نوں کسے لیکج، دراڑاں یا نقصان دے نشاناں لئی نظرثانی کرو جو کولنٹ دے نقصان تے اوورہیٹنگ دا سبب بݨ سکدے نیں۔",
          "انجن نوں آہستہ نال دوبارہ سٹارٹ کرو تے براہ راست نیڑے دے مرمت دی دکان تے جاؤ، درجہ حرارت دے گیج نوں احتیاط نال مانیٹر کردے رہو تے جے ایہہ دوبارہ ودھے تے فوراً رک جاؤ۔"
        ],
        "Images": {
          "carengine": "assets/images/selfHelp/carengineoverhea.png",
          "heat": "assets/images/selfHelp/carHeat.png",
          "carCoolant": "assets/images/selfHelp/carCoolant.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "فوراً کسے چھانویں والی جگہ اُتے بائیک کھڑی کرو تے انجن نوں پوری طرحاں بند کر دیو تاکہ زیادہ گرمی تے کولنگ دی کمی توں ہور نقصان نوں روکیا جا سکے۔",
          "انجن دے آئل لیول نوں ڈپ سٹک یا سائیٹ گلاس دی ورتوں کردے ہوئے چیک کرو، تے جے ایہہ گھٹو گھٹ نشان توں تھلے ہووے تے مناسب لبریکیشن یقینی بݨاؤن لئی تجویز کردہ آئل نال اُپر کرو۔",
          "انجن سلنڈر دے دوالے ایئر کولنگ فنز نوں مٹی، دھول یا ملبے دی رکاوٹاں لئی احتیاط نال چیک کرو، تے جے اوہ بند نظر آن تے اونہاں نوں چنگی طرحاں صاف کرو۔",
          "زیادہ RPMs توں بچو تے درمیانی رفتار نال کافی ہوا دے بہاؤ نال رائیڈ کرو تاکہ انجن ٹھنڈا رہوے جدوں تک تسی صحیح تشخیص لئی نیڑے دے مکینک کول نہیں پہنچ جاندے۔",
          "جے ایہناں قدماں دے باوجود بائیک اوورہیٹ ہوندی رہوے، تے انجن دے نقصان دا خطرہ نہ لوؤ – بلکہ، پیشہ ورانہ مدد لئی کسے مرمت دی سہولت لئی ٹوئنگ دا انتظام کرو۔"
        ],
        "Images": {
          "BikeEngine": "assets/images/selfHelp/bikeOverheat.png",
          "bikecoolant": "assets/images/selfHelp/b_coolant.png",
          "bikeoverheat": "assets/images/selfHelp/B_overheat.png"
        }
      }
    },
    {
      "Name": "بریک فیل / کمزور بریکاں",
      "In Cars": {
        "Tools Required": [
          "بریک فلوئڈ",
          "رنچ"
        ],
        "Steps": [
          "جے ڈرائیونگ کردے ہوئے بریکاں فیل ہو جان، تے ہائیڈرولک دباؤ بݨاؤن لئی بریک پیڈل نوں کئی واری تیزی نال پمپ کرو، کیونکہ بریک لائناں وچ ہوا ہو سکدی اے۔",
          "فوراً نچلے گیئراں وچ شفٹ کرو تاکہ انجن بریکنگ دی ورتوں کیتی جا سکے، تے گڈی دا مضبوط سٹیرنگ کنٹرول برقرار رکھدے ہوئے آہستہ آہستہ ہینڈ بریک لاؤ۔",
          "سڑک دے کنارے یا ایمرجنسی لین وچ احتیاط نال وڑو، اپنی ہیزرڈ لائٹاں دی ورتوں کردے ہوئے دوجے ڈرائیوراں نوں خبردار کرو کہ تسی بریک دے مسئلے دا سامنا کر رہے او۔",
          "ہڈ کھولو تے بریک فلوئڈ ریزروائر لبھو، چیک کرو کہ فلوئڈ لیول گھٹو گھٹ تے زیادہ توں زیادہ نشانات دے وچکار اے کہ نہیں، تے جے ضروری ہووے تے اُپر کرو۔",
          "گڈی دے تھلے تے سارے چار پہیاں دے دوالے بریک فلوئڈ لیکج دے کسے نشان لئی چیک کرو، جو اک سنگین ہائیڈرولک سسٹم دی خرابی دی نشاندہی کردا اے۔",
          "جے بریک پیڈز محفوظ حد توں زیادہ نظر آندے ہوئے گھس چکے نیں، تے گڈی نہ چلاؤ – ایہنوں فوری بریک سسٹم دی تبدیلی لئی ورکشاپ توں ٹو کرواؤ۔"
        ],
        "Images": {
          "carBrakefailure": "assets/images/selfHelp/C_brakefailure.png",
          "carBrakeFluid": "assets/images/selfHelp/carBrakefluid.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "جے تسی کمزور بریکنگ ردعمل محسوس کردے او، تے فوراً انجن بریکنگ دی ورتوں کرو گیئراں وچ تھلے شفٹ کردے ہوئے جدوں کہ آہستہ آہستہ تھراٹل ان پٹ گھٹاؤ۔",
          "ڈرم بریکاں لئی، چیک کرو کہ بریک کیبل نوں ایڈجسٹمنٹ دی ضرورت اے کہ نہیں؛ ڈسک بریکاں لئی، ماسٹر سلنڈر ریزروائر وچ بریک فلوئڈ لیول چیک کرو۔",
          "ڈھیلے بریک کیبلاں نوں ایڈجسٹمنٹ نٹ اُتے کَسو، یا اپنی بائیک دے مالک دے مینول وچ دسے گئے صحیح قسم دی ورتوں کردے ہوئے بریک فلوئڈ نوں احتیاط نال اُپر کرو۔",
          "بریک پیڈز یا شوز نوں گھسائی لئی نظرثانی کرو – جے اوہ پتلے یا خراب نظر آن، تے اونہاں نوں تبدیل کیتا جانا چاہیدا اے ایس توں پہلاں جو بائیک نوں دوبارہ محفوظ طریقے نال چلایا جا سکے۔",
          "اودوں تک رائیڈنگ جاری نہ رکھو جدوں تک بریکاں مضبوط تے ردعمل دین والیاں محسوس نہ ہون – عام ٹریفک حالات وچ واپس آن توں پہلاں اونہاں نوں اک محفوظ علاقے وچ گھٹ رفتار اُتے ٹیسٹ کرو۔"
        ],
        "Images": {
          "bikeBrakefailure": "assets/images/selfHelp/B_brakeFailure.png",
          "BikeBrakepad": "assets/images/selfHelp/B_brakePad.png"
        }
      }
    },
    {
      "Name": "بجلی دی وائرنگ دے مسائل",
      "In Cars": {
        "Tools Required": [
          "اضافی فیوز",
          "ٹیپ",
          "بیسک ٹول کٹ"
        ],
        "Steps": [
          "جے ہیڈلائٹاں یا انڈیکیٹرز ورگے کئی برقی پرزے اکو ویلے ناکام ہو جان، تے ایہہ عام طور اُتے اک جلے ہوئے فیوز دی نشاندہی کردا اے جو اوس سرکٹ نوں متاثر کر رہا اے۔",
          "اپنی گڈی دے فیوز بکس نوں لبھو (عام طور اُتے ڈیش بورڈ دے تھلے یا انجن کمپارٹمنٹ وچ) تے متعلقہ فیوز دی نشاندہی کرن لئی ڈائیگرام نال مشورہ کرو۔",
          "مشتبہ جلے ہوئے فیوز نوں احتیاط نال ہٹاؤ تے اندر دھاتی پٹی نوں چیک کرو – جے ایہہ ٹوٹی ہوئی اے، تے ایہنوں اک نویں فیوز نال تبدیل کرو جس دی ایمپریج ریٹنگ اکو جہی ہووے۔",
          "جے صرف اک بلب خراب ہویا اے، تے پیچ کس دی ورتوں کردے ہوئے لائیٹ اسمبلی دا ڈھکن احتیاط نال ہٹاؤ تے جلے ہوئے بلب نوں اک نویں مطابقت پذیر بلب نال تبدیل کرو۔",
          "کھلی یا خراب وائرنگ لئی، متاثرہ علاقے نوں بجلی دی ٹیپ نال چنگی طرحاں لپیٹو تاکہ شارٹ سرکٹس نوں روکیا جا سکے جدوں تک صحیح مرمت نہیں ہو جاندی۔",
          "جے ایہناں بنیادی ٹھیکیاں دے بعد وی بجلی دے مسائل برقرار رہن، تے ڈرائیونگ کردے ہوئے ہیزرڈ لائٹاں دی ورتوں کرو تے پیشہ ورانہ تشخیص لئی براہ راست آٹو الیکٹریشن کول جاؤ۔"
        ],
        "Images": {
          "carWiring": "assets/images/selfHelp/carWiring.png",
          "carFuses": "assets/images/selfHelp/carFuses.png",
          "carToolkit": "assets/images/selfHelp/carToolkit.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "سب توں پہلاں مین بیٹری کنکشنز نوں چیک کر کے شروع کرو تاکہ یقینی بݨایا جا سکے کہ اوہ مضبوط نیں تے زنگ توں پاک نیں، کیونکہ ڈھیلے ٹرمینل اکثر بجلی دی خرابیاں دا سبب بݨدے نیں۔",
          "سارے نظر آندے وائرنگ کنیکٹرز نوں چیک کرو، خاص طور اُتے اِگنیشن سسٹم تے ہینڈل بارز دے دوالے، کسے وی ڈھیلے یا کٹے ہوئے نوں کَسو۔",
          "چھوٹے فیوز نوں لبھو تے چیک کرو جو عام طور اُتے سیٹ دے تھلے یا بیٹری کمپارٹمنٹ دے نیڑے پایا جاندا اے، ایہنوں تبدیل کرو جے دھاتی پٹی ٹوٹی ہوئی نظر آئے۔",
          "جے ایہناں چیکاں دے باوجود لائٹاں یا اِگنیشن خراب ہوندی رہوے، تے بائیک نوں دوجے گیئر وچ بھجاندے ہوئے تے کلچ نوں اچانک چھڈدے ہوئے پش-سٹارٹ کرن دی کوشش کرو۔",
          "اک واری عارضی طور اُتے چلن لگ پین تے، مناسب بجلی دے سسٹم دی تشخیص تے مستقل وائرنگ دی مرمت لئی احتیاط نال نیڑے دی موٹرسائیکل مرمت دی دکان تے جاؤ۔"
        ],
        "Images": {
          "BikeWiring": "assets/images/selfHelp/b_wiring.png",
          "BikeFuses": "assets/images/selfHelp/b_fuses.png"
        }
      }
    },
    {
      "Name": "تیل دا رِساؤ",
      "In Cars": {
        "Tools Required": [
          "تیل دا کنستر (5–10 لیٹر)",
          "فَنل",
          "کپڑا / ٹشو (گِریا ہویا صاف کرن لئی)"
        ],
        "Steps": [
          "جے تہاڈی کار اچانک بند ہو جائے یا انجن دی کارکردگی خراب ہو جائے، تے سادہ تیل دی کمی نوں رد کرن لئی فوراً اپنے ڈیش بورڈ اُتے فیول گیج چیک کرو۔",
          "احتیاط نال گڈی توں باہر نکلو تے تھلے زمین نوں تازہ گیلے دھبیاں یا تیل دی تیز بو لئی چیک کرو جو خطرناک تیل دے رِساؤ دی نشاندہی کردا اے۔",
          "جے کوئی رِساؤ نہیں لیکن ٹینک خالی اے، تے نیڑے دے سٹیشن توں منظور شدہ حفاظتی کنٹینر وچ تیل حاصل کرو، نقل و حمل دے دوران مناسب وینٹیلیشن یقینی بݨاؤ۔",
          "آہستہ آہستہ فیول فِلر دا ڈھکن کھولو تے فَنل نوں گردن وچ مضبوطی نال رکھو تاکہ تہاڈی پورٹیبل فیول سپلائی نال ریفیولنگ دے عمل دے دوران تیل گِرن توں بچایا جا سکے۔",
          "آہستہ آہستہ ٹینک وچ تیل پاؤ، کدی کدی ہوا نکلن دین لئی رکو تے اوورفلو توں بچو، فیر کم مکمل ہون تے فیول دا ڈھکن مضبوطی نال کَسو۔",
          "گڈی دے باہروں کسے وی گِرے ہوئے تیل نوں کپڑے نال چنگی طرحاں صاف کرو، کیونکہ انجن گرم ہون تے بچیا ہویا تیل اگ لگن دا وڈا خطرہ پیدا کردا اے۔",
          "جے تسی ٹینک یا لائناں توں اصل تیل دے رِساؤ دی تصدیق کر لئی اے، تے انجن سٹارٹ کرن دی کوشش نہ کرو – شدید اگ دے خطرے دی وجہ توں فوراً پیشہ ورانہ روڈ سائیڈ مدد لئی کال کرو۔"
        ],
        "Images": {
          "carFuelLeak": "assets/images/selfHelp/C_fuelleakage1.png",
          "carFuelLeak1": "assets/images/selfHelp/C_fuelleakage2.png",
          "carFuelLeak2": "assets/images/selfHelp/C_fuelleakage3.png",
          "carFuelLeak3": "assets/images/selfHelp/C_fuelleakage4.png",
          "carFuelLeak4": "assets/images/selfHelp/C_fuelleakage5.png",
          "carFuelLeak5": "assets/images/selfHelp/C_fuelleakage6.png",
          "carFuelLeak6": "assets/images/selfHelp/C_fuelleakage7.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "1–2 لیٹر تیل دی بوتل",
          "چھوٹا فَنل",
          "ٹیپ (چھوٹے لیک لئی)"
        ],
        "Steps": [
          "جدوں تہاڈی بائیک غیر متوقع طور اُتے بند ہو جائے، تے سب توں پہلاں تصدیق کرو کہ فیول ٹیپ ON یا RESERVE پوزیشن وچ اے، کیونکہ کدی کدی مین ٹینک خالی ہوندا اے لیکن ریزرو دستیاب رہندا اے۔",
          "ٹینک توں کاربوریٹر تک فیول لائن نوں دراڑاں، پھٹیاں یا ٹپکدے تیل لئی احتیاط نال چیک کرو، چھوٹے لیک لئی اک عارضی سیل دے طور اُتے مضبوط ٹیپ لاؤ۔",
          "جے ٹینک واقعی خالی اے، تے تیل دی نقل و حمل لئی خاص طور اُتے ڈیزائن کیتے گئے اک مناسب دھاتی یا سرٹیفائیڈ پلاسٹک کنٹینر وچ تھوڑی مقدار وچ تیل حاصل کرو۔",
          "تیل گِرن توں بچاؤن لئی اک چھوٹے فَنل دی ورتوں کردے ہوئے، احتیاط نال ٹینک وچ تیل پاؤ جدوں تک ایہہ تقریباً تن چوتھائی بھر نہ جائے تاکہ پھیلن لئی جگہ ملے۔",
          "فیول دا ڈھکن مضبوطی نال کَسو تے بائیک دی سطح توں کسے وی گِرے ہوئے پیٹرول نوں چنگی طرحاں صاف کرو، خاص طور اُتے انجن تے ایگزاسٹ دے علاقے توں۔",
          "مناسب ریفل لئی احتیاط نال درمیانی رفتار نال نیڑے دے پٹرول پمپ تے جاؤ، فیر کسے وی پچھانے گئے لیکج پوائنٹس دی مستقل مرمت لئی مکینک کول جاؤ۔"
        ],
        "Images": {
          "bikeFuelLeak1": "assets/images/selfHelp/B_fuelleakage1.png",
          "bikeFuelLeak2": "assets/images/selfHelp/B_fuelleakage2.png",
          "bikeFuelLeak3": "assets/images/selfHelp/B_fuelleakage3.png",
          "bikeFuelLeak4": "assets/images/selfHelp/B_fuelleakage4.png",
          "bikeFuelLeak5": "assets/images/selfHelp/B_fuelleakage5.png",
          "bikeFuelLeak6": "assets/images/selfHelp/B_fuelleakage6.png"
        }
      }
    },
    {
      "Name": "کلچ دی خرابی",
      "In Cars": {
        "Tools Required": [
          "بریک فلوئڈ (ہائیڈرولک سسٹمز لئی)",
          "بیسک ٹول کٹ"
        ],
        "Steps": [
          "جے کلچ پیڈل غیر معمولی طور اُتے نرم، سپنجی محسوس ہووے، یا اپنی عام پوزیشن اُتے واپس آن وچ ناکام ہو جائے، تے فوراً معائنے لئی اک محفوظ جگہ اُتے کھڑا کرو۔",
          "ڈیش بورڈ دے تھلے کلچ پیڈل میکانزم دے دوالے تے انجن بے وچ ہائیڈرولک فلوئڈ لیکج دے نظر آندے نشاناں لئی چیک کرو جو سسٹم دی خرابی دی نشاندہی کردے نیں۔",
          "کلچ فلوئڈ ریزروائر نوں لبھو (عام طور اُتے بریک ماسٹر سلنڈر دے نیڑے ہوندا اے) تے گھٹو گھٹ تے زیادہ توں زیادہ اشارے دے نشانات دے مطابق فلوئڈ لیول چیک کرو۔",
          "جے ریزروائر گھٹ ہووے، تے ایہنوں مناسب قسم دے بریک فلوئڈ نال احتیاط نال اُپر کرو، ہائیڈرولک سسٹم وچ ہوا دے بلبلے شامل نہ کرن دا خیال رکھو۔",
          "کیبل نال چلن والے کلچ والیاں گڈیاں لئی جِتھے کیبل پوری طرحاں ٹٹ گئی ہووے، تسی عام طور اُتے گیئر نہیں لا سکدے تے تہاڈی گڈی نوں پیشہ ورانہ ٹوئنگ سروس دی ضرورت پئے گی۔",
          "جے فلوئڈ ٹاپ اپ توں بعد کلچ معمولی طور اُتے کم کردا اے، تے تسی گھٹو گھٹ کلچ دی ورتوں نال آہستہ نال گیئر لا سکدے او تے ہولی ہولی براہ راست نیڑے دی مرمت دی سہولت تک جا سکدے او۔"
        ],
        "Images": {
          "carClutch1": "assets/images/selfHelp/C_clutchfailure1.png",
          "carClutch2": "assets/images/selfHelp/C_clutchfailure2.png",
          "carClutch3": "assets/images/selfHelp/C_clutchfailure3.png",
          "carClutch4": "assets/images/selfHelp/C_clutchfailure4.png",
          "carClutch5": "assets/images/selfHelp/C_clutchfailure5.png",
          "carClutch6": "assets/images/selfHelp/C_clutchfailure6.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "جدوں کلچ لیور ڈھیلا، لٹکیا ہویا محسوس ہووے، یا کلچ نوں صحیح طریقے نال چھڈن وچ ناکام ہو جائے، تے سب توں پہلاں لیور تے انجن دے دوہاں سریاں اُتے کلچ کیبل کنکشن نوں چیک کرو۔",
          "کدی کدی کیبل دا سرا صرف اپنی ریٹینشن سلاٹ توں پھسل جاندا اے – جے کیبل ٹھیک اے، تے ایہنوں احتیاط نال صحیح پوزیشن وچ دوبارہ پاؤ تے ٹینشن نوں دوبارہ ایڈجسٹ کرو۔",
          "جے کلچ کیبل پوری طرحاں ٹٹ گئی اے، تے ایہنوں اک اضافی کیبل نال تبدیل کرو (جو تجربہ کار رائیڈرز اکثر نال رکھدے نیں) اپنی بائیک دے مخصوص روٹنگ پیٹرن دے مطابق۔",
          "اضافی کیبل دے بغیر، تسی بائیک نوں نیوٹرل وچ پش-سٹارٹ کر سکدے او، فیر کلچ دی ورتوں کیتے بغیر انجن RPM نوں سڑک دی رفتار نال مِلا کے احتیاط نال گیئر شفٹ کرو۔",
          "تھوڑی دیر لئی تھراٹل توں ہتھ ہٹاندے ہوئے گیئر لیور اُتے تھوڑا جہیا اُپر دباؤ لا کے کلچلیس شفٹنگ دی مشق کرو، فیر احتیاط نال مکینک کول جاؤ۔"
        ],
        "Images": {
          "bikeClutch1": "assets/images/selfHelp/B_clutchfailure1.png",
          "bikeClutch2": "assets/images/selfHelp/B_clutchfailure2.png",
          "bikeClutch3": "assets/images/selfHelp/B_clutchfailure3.png",
          "bikeClutch4": "assets/images/selfHelp/B_clutchfailure4.png",
          "bikeClutch5": "assets/images/selfHelp/B_clutchfailure5.png"
        }
      }
    },
    {
      "Name": "سٹارٹر موٹر دی خرابی",
      "In Cars": {
        "Tools Required": [
          "ہتھوڑا یا رنچ (ٹھوکݨ لئی)",
          "جمپر کیبلز"
        ],
        "Steps": [
          "جدوں اِگنیشن دی چابی گھمان نال انجن کرینک ہوئے بغیر صرف کلک دی آواز آوے، تے سب توں پہلاں ملٹی میٹر یا بصری اشاریاں دی ورتوں کردے ہوئے تصدیق کرو کہ تہاڈی بیٹری وچ کافی چارج اے۔",
          "جے بیٹری پاور کافی تصدیق شدہ اے، تے مسئلہ غالباً اک پھنسے ہوئے سٹارٹر موٹر نال متعلق اے جو انجن دے فلائی وہیل دے دنداں نال صحیح طریقے نال نہیں جڑ رہی۔",
          "سٹارٹر موٹر نوں لبھو (عام طور اُتے انجن اُتے ٹرانسمیشن بیل ہاؤسنگ دے نیڑے تھلے نصب ہوندی اے) جو بجلی دے کنکشنز نال اک سلنڈر والا حصہ اے۔",
          "اک معاون توں اِگنیشن دی چابی گھماؤ جدوں تسی ہتھوڑے یا رنچ نال سٹارٹر موٹر دے جسم نوں آہستہ نال ٹھوکو – ایہہ ہلچل پھنسے ہوئے اندرونی پرزیاں نوں آزاد کر سکدی اے۔",
          "جے ٹھوکݨ نال کم نہ ہووے، تے اک ہور گڈی نال جمپ-سٹارٹ کرن دی کوشش کرو تاکہ کمزور بیٹری دے ناکافی کرینکنگ ایمپریج دین دے امکان نوں ختم کیتا جا سکے۔",
          "جدوں ایہہ سارے طریقے ناکام ہو جان، تے پوری بیٹری ختم ہون توں بچن لئی ہور کوششاں بند کرو تے پیشہ ورانہ تشخیص تے ممکنہ ٹوئنگ لئی روڈ سائیڈ مدد نوں رابطہ کرو۔"
        ],
        "Images": {
          "carStarter1": "assets/images/selfHelp/C_startermotor1.png",
          "carStarter2": "assets/images/selfHelp/C_startermotor2.png",
          "carStarter3": "assets/images/selfHelp/C_startermotor3.png",
          "carStarter4": "assets/images/selfHelp/C_startermotor4.png",
          "carStarter5": "assets/images/selfHelp/C_startermotor5.png",
          "carStarter6": "assets/images/selfHelp/C_startermotor6.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "جے الیکٹرک سٹارٹر بٹن توں کوئی ردعمل نہ ملے، تے سب توں پہلاں ملٹی میٹر نال بیٹری وولٹیج چیک کرو یا تصدیق کرو کہ دوجے برقی نظام عام طور اُتے کم کر رہے نیں۔",
          "جے تہاڈی بائیک وچ کِک سٹارٹر لگا ہویا اے تے ایہنوں ورتو – کامیاب کِک سٹارٹنگ اک برقی مسئلے دی نشاندہی کردی اے نہ کہ اک مکینیکل انجن دے مسئلے دی۔",
          "جے کِک سٹارٹر کم کردا اے لیکن الیکٹرک بٹن نہیں کردا، تے سٹارٹر ریلے تے متعلقہ وائرنگ کنکشنز نوں زنگ، نقصان یا کٹاوٹ لئی چیک کرو۔",
          "اک مکینیکی طور اُتے جام شدہ سٹارٹر موٹر لئی، بائیک دے نال دوجے گیئر وچ بھجاندے ہوئے تے اچانک کلچ چھڈدے ہوئے پش-سٹارٹ کرن دی کوشش کرو جدوں تسی اُتے چھال ماردے او۔",
          "جے سٹارٹر موٹر ٹیسٹنگ یا مخصوص سڑن والی بو توں خراب ہون دی تصدیق ہو جائے، تے ایہنوں موٹرسائیکل مرمت دی ورکشاپ وچ پیشہ ورانہ تبدیلی دی ضرورت اے۔"
        ],
        "Images": {
          "bikeStarter1": "assets/images/selfHelp/B_startermotor1.png",
          "bikeStarter2": "assets/images/selfHelp/B_startermotor2.png",
          "bikeStarter3": "assets/images/selfHelp/B_startermotor3.png",
          "bikeStarter4": "assets/images/selfHelp/B_startermotor4.png",
          "bikeStarter5": "assets/images/selfHelp/B_startermotor5.png"
        }
      }
    },
    {
      "Name": "انڈیکیٹر دی خرابی",
      "In Cars": {
        "Tools Required": [
          "اضافی بلب",
          "فیوز کِٹ",
          "پیچ کس"
        ],
        "Steps": [
          "جدوں ہیڈلائٹاں یا ٹرن سگنل ورگے کئی لائٹنگ پرزے اکو ویلے ناکام ہو جان، تے ایہہ عام طور اُتے اک جلے ہوئے فیوز دی نشاندہی کردا اے جو پورے لائٹنگ سرکٹ نوں متاثر کر رہا اے۔",
          "پرائمری فیوز بکس (عام طور اُتے ڈیش بورڈ دے تھلے یا انجن بے وچ) نوں لبھن لئی اپنی گڈی دے مینول نال مشورہ کرو جیہدے وچ لائٹنگ سسٹم دے فیوز ہوندے نیں۔",
          "ڈائیگرام دی ورتوں کردے ہوئے خراب لائٹاں لئی مخصوص فیوز دی نشاندہی کرو، ایہنوں احتیاط نال ہٹاؤ، تے صحیح حفاظت لئی اکو جہی ایمپریج ریٹ والے نویں فیوز نال تبدیل کرو۔",
          "جے صرف اک بلب خراب ہویا اے، تے مناسب پیچ کساں دی ورتوں کردے ہوئے لائیٹ اسمبلی دا ڈھکن احتیاط نال ہٹاؤ تے مخصوص جلے ہوئے بلب نوں اک مطابقت پذیر نویں بلب نال تبدیل کرو۔",
          "ڈھیلے کنکشنز یا تھوڑی جیہی کھلی وائرنگ لئی، معیاری بجلی دی ٹیپ نوں عارضی انسولیشن دے طور اُتے لاؤ جدوں تک صحیح مرمت نہیں ہو جاندی۔",
          "مستقل مرمت مکمل ہون تک، ضرورت پین تے ہیزرڈ لائٹاں دی ورتوں کرو تے اضافی احتیاط نال چلاؤ، خاص طور اُتے گھٹ نظر آن والے حالات یا رات دی ڈرائیونگ دے دوران۔"
        ],
        "Images": {
          "carHeadlight1": "assets/images/selfHelp/C_indicator1.png",
          "carHeadlight2": "assets/images/selfHelp/C_indicator2.png",
          "carHeadlight3": "assets/images/selfHelp/C_indicator3.png",
          "carHeadlight4": "assets/images/selfHelp/C_indicator4.png",
          "carHeadlight5": "assets/images/selfHelp/C_indicator5.png",
          "carHeadlight6": "assets/images/selfHelp/C_indicator6.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "جے تہاڈی موٹرسائیکل دی ہیڈلائٹ روشن ہون وچ ناکام ہو جاندی اے، تے سب توں پہلاں اپنی بائیک دے ڈیزائن دے مطابق آلے دوالے دا ڈھکن یا بیزل ہٹا کے ہیڈلیمپ اسمبلی تک رسائی حاصل کرو۔",
          "پرانے بلب نوں اوہدی ریٹینشن کلپ چھڈ کے یا الٹی گھڑی دی دیشا وچ گھما کے احتیاط نال ہٹاؤ، فیر شیشے دی سطح نوں چھوئے بغیر اک نواں مطابقت پذیر بلب لگاؤ۔",
          "مین برقی فیوز نوں لبھو تے چیک کرو جو عام طور اُتے سیٹ دے تھلے یا بیٹری کمپارٹمنٹ دے نیڑے پایا جاندا اے، ایہنوں تبدیل کرو جے اندرونی عنصر ٹٹیا ہویا نظر آئے۔",
          "ٹرن سگنل دی ناکامی لئی، ہیڈلائٹ کیسنگ دے اندر فلیشر ریلے تے سارے وائرنگ کنکشنز نوں زنگ، ڈھیلے پن، یا کٹاوٹ دے مسئلیاں لئی چیک کرو۔",
          "جے فوری مرمت کرن وچ ناکام او، تے مُڑن تے بریکاں لئی مناسب ہتھ دے اشاریاں دی ورتوں کرو، تے رات دی رائیڈنگ توں بچو جدوں تک سارے لائٹنگ سسٹم پوری طرحاں کم نہیں کردے۔"
        ],
        "Images": {
          "bikeHeadlight1": "assets/images/selfHelp/B_indicator1.png",
          "bikeHeadlight2": "assets/images/selfHelp/B_indicator2.png",
          "bikeHeadlight3": "assets/images/selfHelp/B_indicator3.png",
          "bikeHeadlight4": "assets/images/selfHelp/B_indicator4.png",
          "bikeHeadlight5": "assets/images/selfHelp/B_indicator5.png"
        }
      }
    }
  ]
}