{
  "Breakdowns": [
    {
      "Name": "فلیٹ ٹائر / پنکچر",
      "In Cars": {
        "Tools Required": [
          "اسپیئر ٹائر",
          "جیک",
          "وہیل اسپینر",
          "انتباہی مثلث"
        ],
        "Steps": [
          "ٹریفک سے دور ایک ہموار، مستحکم سطح پر گاڑی کو بحفاظت کھڑا کریں اور دوسرے ڈرائیوروں کو خبردار کرنے کے لیے فوراً اپنی ہیزرڈ لائٹس آن کریں۔",
          "اپنی گاڑی کے 30-40 میٹر پیچھے چل کر سڑک پر انتباہی مثلث (وارننگ ٹرائی اینگل) رکھیں تاکہ آپ کے مرمت کے کام کے لیے ایک محفوظ علاقہ بن سکے۔",
          "وہیل اسپینر کا استعمال کرتے ہوئے، وہیل نٹس کو گھڑی کی مخالف سمت میں موڑ کر ڈھیلا کریں، لیکن اس مرحلے پر انہیں مکمل طور پر نہ ہٹائیں۔",
          "فلیٹ ٹائر کے قریب گاڑی کے مخصوص لفٹنگ پوائنٹ کے نیچے کار جیک کو پوزیشن میں رکھیں اور گاڑی کو آہستہ آہستہ اوپر اٹھائیں جب تک کہ ٹائر مکمل طور پر زمین سے اوپر نہ آجائے۔",
          "اب تمام ڈھیلے کیے ہوئے وہیل نٹس کو مکمل طور پر ہٹا دیں اور فلیٹ ٹائر کو احتیاط سے وہیل اسٹڈز سے سیدھا اتار لیں، اسے متوازن رکھیں۔",
          "اسپیئر ٹائر کو وہیل اسٹڈز کے ساتھ سیدھا کریں اور اسے جگہ پر دھکیلیں، پھر تمام نٹس کو سٹار پیٹرن میں ہاتھ سے کس لیں تاکہ برابر سیٹنگ یقینی ہو۔",
          "جیک کو نیچے کریں جب تک ٹائر زمین کو چھو نہ لے، پھر وہیل اسپینر کا استعمال کرتے ہوئے نٹس کو کرس کراس پیٹرن میں مکمل طور پر کس لیں تاکہ زیادہ سے زیادہ مضبوطی حاصل ہو۔",
          "تمام اوزار اور فلیٹ ٹائر کو احتیاط سے اپنے ڈکی میں رکھیں، پھر نقصان زدہ ٹائر کو ٹھیک کروانے یا تبدیل کروانے کے لیے قریب ترین مرمت کی دکان تک احتیاط سے گاڑی چلائیں۔"
        ],
        "Images": {
          "flatTyre": "assets/images/selfHelp/flat-tyreCar.png",
          "jackCar": "assets/images/selfHelp/jackCar.png",
          "carSpanner": "assets/images/selfHelp/carSapnner.png",
          "triangleCar": "assets/images/selfHelp/Trainglecar.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "پنکچر کٹ",
          "اسپیئر ٹیوب",
          "ٹائر لیور",
          "ہینڈ پمپ"
        ],
        "Steps": [
          "اپنی بائیک کو اس کے مین اسٹینڈ یا سینٹر اسٹینڈ پر بحفاظت کھڑا کریں، پھر اس ٹائر کے مطابق سامنے یا پچھلے پہیے کو ہٹا دیں جس میں پنکچر ہے۔",
          "ٹائر اور رم کے درمیان ٹائر لیور ڈالیں، پھر ٹائر کے ایک سائیڈ کو رم کے کنارے پر احتیاط سے اٹھائیں، سرکنفرنس کے گرد اپنا راستہ بناتے ہوئے۔",
          "اندرونی ٹیوب کو مکمل طور پر باہر نکالیں، پھر اسے ہلکا سا پھلائیں اور ہوا نکلنے کی آوازوں کے لیے احتیاط سے سنیں یا ہوا کے رساؤ کو محسوس کریں تاکہ پنکچر کا پتہ لگایا جاسکے۔",
          "چھوٹے سوراخوں کے لیے، پنکچر کے ارد گرد کے علاقے کو رگڑنے والے کاغذ سے کھردرہ کریں، ربڑ سیمنٹ لگائیں، اور پیچ کو مضبوطی سے دبائیں؛ بڑے پھٹنے کے لیے، ایک نئی ٹیوب لگائیں۔",
          "مرمت شدہ یا نئی ٹیوب کو احتیاط سے ٹائر کے اندر واپس رکھیں، اس بات کو یقینی بناتے ہوئے کہ یہ مڑا ہوا نہ ہو، پھر ٹائر بیڈ کو اپنے ہاتھوں اور لیورز کا استعمال کرتے ہوئے رم پر واپس چڑھائیں۔",
          "ہینڈ پمپ کا استعمال کرتے ہوئے ٹائر کو تجویز کردہ دباؤ تک پھلائیں، پہیے کو بائیک پر دوبارہ فٹ کریں، اور مرمت کی تصدیق کے لیے آہستہ ٹیسٹ رائڈ لیں۔"
        ],
        "Images": {
          "flatTyrebike": "assets/images/selfHelp/t2.png",
          "punturekitBike": "assets/images/selfHelp/B-kit.png",
          "bikeSpareTube": "assets/images/selfHelp/b-tube.png",
          "bikeHandpump": "assets/images/selfHelp/bPump.png"
        }
      }
    },
    {
      "Name": "بیٹری کی خرابی / ڈیڈ بیٹری",
      "In Cars": {
        "Tools Required": [
          "جمپر کیبلز",
          "اچھی بیٹری والی دوسری کار"
        ],
        "Steps": [
          "مدد فراہم کرنے والی گاڑی کو اتنا قریب رکھیں کہ جمپر کیبلز دونوں بیٹریوں تک پہنچ سکیں، لیکن اس بات کو یقینی بنائیں کہ گاڑیاں آپس میں نہ ٹکرائیں، پھر دونوں اگنیشن مکمل طور پر بند کر دیں۔",
          "ایک سرخ کلیمپ کو اپنی ڈیڈ بیٹری کے مثبت (+) ٹرمینل سے جوڑیں، پھر دوسرے سرخ کلیمپ کو اچھی بیٹری کے مثبت ٹرمینل سے لگائیں۔",
          "ایک کالی کلیمپ کو اچھی بیٹری کے منفی (-) ٹرمینل سے جوڑیں، پھر آخری کالی کلیمپ کو اپنی کار کے انجن بلاک پر ایک بغیر پینٹ شدہ دھاتی سطح سے لگائیں۔",
          "کام کرنے والی گاڑی کا انجن سٹارٹ کریں اور اسے 2-3 منٹ تک درمیانی رفتار سے چلنے دیں تاکہ آپ کی ڈیڈ بیٹری میں کچھ چارج منتقل ہو سکے۔",
          "اپنی کار کو سٹارٹ کرنے کی کوشش کریں - اگر یہ کامیابی سے سٹارٹ ہو جاتی ہے تو، کیبلز کو کنکشن کے الٹے ترتیب میں احتیاط سے منقطع کرنے سے پہلے دونوں گاڑیوں کو مزید ایک منٹ چلنے دیں۔",
          "اپنی گاڑی کو کم از کم 15-20 منٹ تک مسلسل چلائیں تاکہ آلٹرنیٹر بیٹری کو دوبارہ چارج کر سکے اس سے پہلے کہ انجن کو دوبارہ بند کیا جائے۔"
        ],
        "Images": {
          "carBattery": "assets/images/selfHelp/carDeadbattery.png",
          "batteryshare": "assets/images/selfHelp/carBatteryshare.png",
          "jumperCablesCar": "assets/images/selfHelp/carJumpercable.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "پورٹ ایبل بیٹری بوسٹر",
          "جمپر کیبلز"
        ],
        "Steps": [
          "حفاظت کے لیے کسی بھی بیٹری کنکشن کے طریقہ کار کو شروع کرنے سے پہلے یقینی بنائیں کہ دونوں بائیک نیوٹرل میں ہیں اور اگنیشن سوئچ مکمل طور پر بند ہیں۔",
          "پہلے سرخ جمپر کیبل کو اپنی ڈیڈ بیٹری کے مثبت ٹرمینل سے جوڑیں، پھر دوسرا سرخ سرا ڈونر بائیک کے مثبت ٹرمینل سے لگائیں۔",
          "کالی کیبل کو ڈونر بائیک کی بیٹری کے منفی ٹرمینل سے لگائیں، پھر آخری کالی کلیمپ کو اپنی بائیک کے فریم یا انجن کے دھاتی حصے سے جوڑیں۔",
          "ڈونر بائیک کا انجن سٹارٹ کریں اور اسے ایک منٹ تک چلنے دیں، پھر اپنی بائیک کو سٹارٹ کرنے کی کوشش کریں اگر ضرورت ہو تو آہستہ سے تھروٹل دیں۔",
          "ایک بار جب آپ کی بائیک کامیابی سے سٹارٹ ہو جائے، تو کیبلز کو احتیاط سے الٹی ترتیب میں منقطع کریں، پھر کم از کم 30 منٹ تک سواری کریں تاکہ بیٹری صحیح طریقے سے ریچارج ہو سکے۔"
        ],
        "Images": {
          "defectedbatteryBike": "assets/images/selfHelp/B_batteryFailure.png",
          "BikebatteryBooster": "assets/images/selfHelp/B_batteryBooster.png",
          "bikejumperCable": "assets/images/selfHelp/B_jumperCable.png"
        }
      }
    },
    {
      "Name": "انجن کا زیادہ گرم ہونا",
      "In Cars": {
        "Tools Required": [
          "دستانے",
          "پانی/کولنٹ",
          "کپڑا"
        ],
        "Steps": [
          "فوری طور پر ایک محفوظ مقام پر گاڑی کھڑی کریں اور انجن کو مکمل طور پر بند کر دیں - انجن گرم ہوتے ہوئے ریڈی ایٹر کا ڈھکن کھولنے کی کوشش کبھی نہ کریں۔",
          "انجن کو مناسب طور پر ٹھنڈا ہونے کے لیے 15-20 منٹ تک صبر سے انتظار کریں اس سے پہلے کہ کولنگ سسٹم کے کسی بھی حصے کا معائنہ کرنے یا اسے چھونے کی کوشش کریں۔",
          "حفاظت کے لیے دستانے پہنیں، پھر احتیاط سے بونٹ کھولیں اور کولنٹ ریزروائر تلاش کریں، سیال کی سطح کو کم سے کم اور زیادہ سے زیادہ نشانات کے خلاف چیک کریں۔",
          "اگر کولنٹ کم ہے، تو آہستہ آہستہ 50/50 کولنٹ اور پانی کا مکسچر شامل کریں جب تک کہ یہ زیادہ سے زیادہ بھرنے والی لائن تک نہ پہنچ جائے، ریزروائر کو زیادہ بھرنے سے گریز کریں۔",
          "ریڈی ایٹر، ہوزز، اور واٹر پمپ کا بصری معائنہ کریں تاکہ کسی بھی رساؤ، دراڑ، یا نقصان کی علامات کو تلاش کیا جا سکے جو کولنٹ کے نقصان اور زیادہ گرم ہونے کا سبب بن سکتا ہے۔",
          "انجن کو آہستہ سے دوبارہ سٹارٹ کریں اور سیدھے قریب ترین مرمت کی دکان تک چلائیں، درجہ حرارت کے گیج کو قریب سے مانیٹر کریں اور اگر یہ دوبارہ بڑھتا ہے تو فوری طور پر روک دیں۔"
        ],
        "Images": {
          "carengine": "assets/images/selfHelp/carengineoverhea.png",
          "heat": "assets/images/selfHelp/carHeat.png",
          "carCoolant": "assets/images/selfHelp/carCoolant.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "فوری طور پر کسی سایہ دار جگہ پر بائیک کھڑی کریں اور انجن کو مکمل طور پر بند کر دیں تاکہ زیادہ گرمی اور کولنگ کی کمی سے مزید نقصان نہ ہو۔",
          "ڈپس ٹک یا سائٹ گلاس کا استعمال کرتے ہوئے انجن آئل کی سطح کو چیک کریں، اور اگر یہ کم از کم نشان سے نیچے ہو تو تجویز کردہ آئل سے اوپر تک بھریں تاکہ مناسب چکنائی یقینی ہو۔",
          "انجن سلنڈر کے ارد گرد ایئر کولنگ فنز کا احتیاط سے معائنہ کریں تاکہ مٹی، دھول یا ملبے سے کسی بھی رکاوٹ کو تلاش کیا جا سکے، اور اگر وہ بند نظر آئیں تو انہیں اچھی طرح صاف کریں۔",
          "زیادہ RPMs سے گریز کریں اور مناسب تشخیص کے لیے قریب ترین مکینک کے پاس جاتے ہوئے مناسب ہوا کے بہاؤ کے ساتھ درمیانی رفتار سے سواری کریں تاکہ انجن کو ٹھنڈا کرنے میں مدد ملے۔",
          "اگر ان اقدامات کے باوجود بائیک گرم ہوتی رہتی ہے، تو انجن کو نقصان پہنچانے کا خطرہ نہ لیں - اس کے بجائے، پیشہ ورانہ مدد کے لیے مرمت کی سہولت تک ٹو (کھینچ کر لے جانے) کا بندوبست کریں۔"
        ],
        "Images": {
          "BikeEngine": "assets/images/selfHelp/bikeOverheat.png",
          "bikecoolant": "assets/images/selfHelp/b_coolant.png",
          "bikeoverheat": "assets/images/selfHelp/B_overheat.png"
        }
      }
    },
    {
      "Name": "بریک کی ناکامی / کمزور بریک",
      "In Cars": {
        "Tools Required": [
          "بریک فلوئڈ",
          "رینچ"
        ],
        "Steps": [
          "اگر ڈرائیونگ کے دوران بریک فیل ہو جائیں، تو بریک پیڈل کو کئی بار تیزی سے پمپ کریں تاکہ ہائیڈرولک پریشر بن سکے، کیونکہ بریک لائنز میں ہوا ہو سکتی ہے۔",
          "فوری طور پر نچلے گیئرز میں شفٹ کریں تاکہ انجن بریکنگ کا استعمال کیا جا سکے، اور گاڑی پر مضبوط اسٹیئرنگ کنٹرول برقرار رکھتے ہوئے آہستہ آہستہ ہینڈ بریک لگائیں۔",
          "احتیاط سے سڑک کے کنارے یا ایمرجنسی لین کی طرف بڑھیں، اپنی ہیزرڈ لائٹس کا استعمال کریں تاکہ دوسرے ڈرائیوروں کو خبردار کیا جا سکے کہ آپ کو بریک کے مسائل درپیش ہیں۔",
          "بونٹ کھولیں اور بریک فلوئڈ ریزروائر تلاش کریں، چیک کریں کہ فلوئڈ کی سطح کم سے کم اور زیادہ سے زیادہ نشانات کے درمیان ہے، اور اگر ضروری ہو تو اوپر تک بھریں۔",
          "گاڑی کے نیچے اور چاروں پہیوں کے گرد بریک فلوئڈ کے کسی بھی رساؤ کی علامات کا معائنہ کریں، جو ایک سنگین ہائیڈرولک سسٹم کی ناکامی کی نشاندہی کرے گا۔",
          "اگر بریک پیڈز محفوظ حدوں سے زیادہ نمایاں طور پر گھسے ہوئے ہیں، تو گاڑی نہ چلائیں - اسے فوری بریک سسٹم کی تبدیلی کے لیے ورکشاپ تک ٹو کروائیں۔"
        ],
        "Images": {
          "carBrakefailure": "assets/images/selfHelp/C_brakefailure.png",
          "carBrakeFluid": "assets/images/selfHelp/carBrakefluid.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "اگر آپ کو کمزور بریکنگ رسپانس کا سامنا ہوتا ہے، تو فوری طور پر گیئرز کے ذریعے ڈاؤن شفٹ کرتے ہوئے انجن بریکنگ کا استعمال کریں جبکہ تھروٹل ان پٹ کو آہستہ آہستہ کم کریں۔",
          "ڈرم بریکز کے لیے، چیک کریں کہ کیا بریک کیبل کو ایڈجسٹمنٹ کی ضرورت ہے؛ ڈسک بریکز کے لیے، ماسٹر سلنڈر ریزروائر میں بریک فلوئڈ کی سطح کا معائنہ کریں۔",
          "ایڈجسٹمنٹ نٹ پر ڈھیلی بریک کیبلز کو کس لیں، یا اپنی بائیک کے مالک کے دستی میں بیان کردہ صحیح قسم کا بریک فلوئڈ احتیاط سے اوپر تک بھریں۔",
          "بریک پیڈز یا شوز کو پہننے کے لیے بصری طور پر معائنہ کریں - اگر وہ پتلے یا خراب نظر آتے ہیں، تو انہیں تبدیل کرنا ضروری ہے اس سے پہلے کہ بائیک کو دوبارہ بحفاظت چلایا جا سکے۔",
          "جب تک بریک مضبوط اور ریسپانسیو محسوس نہ ہوں تب تک سواری جاری نہ رکھیں - عام ٹریفک حالات میں واپس آنے سے پہلے انہیں ایک محفوظ علاقے میں کم رفتار پر ٹیسٹ کریں۔"
        ],
        "Images": {
          "bikeBrakefailure": "assets/images/selfHelp/B_brakeFailure.png",
          "BikeBrakepad": "assets/images/selfHelp/B_brakePad.png"
        }
      }
    },
    {
      "Name": "الیکٹریکل وائرنگ کے مسائل",
      "In Cars": {
        "Tools Required": [
          "اسپیئر فیوز",
          "ٹیپ",
          "بنیادی ٹول کٹ"
        ],
        "Steps": [
          "اگر ہیڈلائٹس یا انڈیکیٹرز جیسے متعدد برقی اجزاء بیک وقت فیل ہو جائیں، تو یہ عام طور پر ایک اڑے ہوئے فیوز کی نشاندہی کرتا ہے جو اس سرکٹ کو متاثر کر رہا ہے۔",
          "اپنی گاڑی کا فیوز باکس تلاش کریں (عام طور پر ڈیش بورڈ کے نیچے یا انجن کے ڈبے میں) اور متعلقہ فیوز کی شناخت کے لیے ڈایاگرام سے مشورہ کریں۔",
          "مشتبہ اڑے ہوئے فیوز کو احتیاط سے ہٹا دیں اور اندرونی دھاتی پٹی کا معائنہ کریں - اگر یہ ٹوٹی ہوئی ہے، تو اسے اسی ایمپیریج ریٹنگ کے ایک نئے فیوز سے تبدیل کریں۔",
          "اگر صرف ایک بلب فیل ہوا ہے، تو ایک سکریو ڈرایور کا استعمال کرتے ہوئے لائٹ اسمبلی کا کور احتیاط سے ہٹا دیں اور جلے ہوئے بلب کو ایک نئے مطابقت پذیر بلب سے تبدیل کریں۔",
          "کھلی یا خراب وائرنگ کے لیے، شارٹ سرکٹس کو روکنے کے لیے متاثرہ علاقے کو برقی ٹیپ سے اچھی طرح لپیٹیں جب تک کہ مناسب مرمت نہ کی جا سکے۔",
          "اگر ان بنیادی اصلاحات کے بعد بھی برقی مسائل برقرار رہتے ہیں، تو ڈرائیونگ کرتے وقت ہیزرڈ لائٹس کا استعمال کریں اور پیشہ ورانہ تشخیص کے لیے براہ راست ایک آٹو الیکٹریشن کے پاس جائیں۔"
        ],
        "Images": {
          "carWiring": "assets/images/selfHelp/carWiring.png",
          "carFuses": "assets/images/selfHelp/carFuses.png",
          "carToolkit": "assets/images/selfHelp/carToolkit.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "سب سے پہلے مین بیٹری کنکشنز کو چیک کریں تاکہ یہ یقینی بنایا جا سکے کہ وہ مضبوط ہیں اور زنگ سے پاک ہیں، کیونکہ ڈھیلے ٹرمینلز اکثر برقی ناکامیوں کا سبب بنتے ہیں۔",
          "تمام نظر آنے والے وائرنگ کنیکٹرز کا معائنہ کریں، خاص طور پر اگنیشن سسٹم اور ہینڈل بارز کے گرد، جو بھی ڈھیلا یا منقطع نظر آئے اسے کس لیں۔",
          "چھوٹے فیوز کو تلاش کریں اور چیک کریں جو عام طور پر سیٹ کے نیچے یا بیٹری کے ڈبے کے قریب ہوتا ہے، اگر دھاتی پٹی ٹوٹی ہوئی نظر آتی ہے تو اسے تبدیل کریں۔",
          "اگر ان چیکس کے باوجود لائٹس یا اگنیشن فیل ہوتے رہتے ہیں، تو بائیک کو دوسرے گیئر میں دوڑاتے ہوئے اور اچانک کلچ چھوڑ کر پش سٹارٹ کرنے کی کوشش کریں۔",
          "عارضی طور پر چلنے کے بعد، مناسب برقی سسٹم کی تشخیص اور مستقل وائرنگ کی مرمت کے لیے احتیاط سے قریب ترین موٹرسائیکل مرمت کی دکان تک سواری کریں۔"
        ],
        "Images": {
          "BikeWiring": "assets/images/selfHelp/b_wiring.png",
          "BikeFuses": "assets/images/selfHelp/b_fuses.png"
        }
      }
    },
    {
      "Name": "ایندھن کا رساؤ",
      "In Cars": {
        "Tools Required": [
          "ایندھن کا کین (5–10 لیٹر)",
          "فنیل",
          "کپڑا / ٹشو (گرے ہوئے تیل کو صاف کرنے کے لیے)"
        ],
        "Steps": [
          "اگر آپ کی کار اچانک رک جاتی ہے یا انجن کی کارکردگی غیر معمولی ہو جاتی ہے، تو سادہ ایندھن کی کمی کو مسترد کرنے کے لیے فوری طور پر اپنے ڈیش بورڈ پر ایندھن کے گیج کو چیک کریں۔",
          "احتیاط سے گاڑی سے باہر نکلیں اور نیچے زمین کا معائنہ کریں تاکہ تازہ گیلے دھبے یا ایندھن کی تیز بدبو کا پتہ چلایا جا سکے جو خطرناک ایندھن کے رساؤ کی نشاندہی کرے گا۔",
          "اگر کوئی رساؤ نہیں ہے لیکن ٹینک خالی ہے، تو قریب ترین اسٹیشن سے منظور شدہ حفاظتی کنٹینر میں ایندھن حاصل کریں، ٹرانسپورٹ کے دوران مناسب وینٹیلیشن کو یقینی بنائیں۔",
          "ایندھن کے فلر کیپ کو آہستہ سے کھولیں اور فنیل کو گردن میں مضبوطی سے پوزیشن میں رکھیں تاکہ آپ کے پورٹیبل ایندھن کی فراہمی کے ساتھ ایندھن بھرنے کے عمل کے دوران چھلکنے سے بچا جا سکے۔",
          "ٹینک میں ایندھن آہستہ آہستہ ڈالیں، وقفے وقفے سے ہوا کو باہر نکلنے کی اجازت دیں اور اوور فلو کو روکیں، پھر مکمل ہونے پر ایندھن کا کیپ مضبوطی سے بند کریں۔",
          "گاڑی کے باہر گرے ہوئے کسی بھی ایندھن کو کپڑے سے اچھی طرح صاف کریں، کیونکہ انجن گرم ہونے پر بقایا ایندھن آگ لگنے کا ایک اہم خطرہ پیش کرتا ہے۔",
          "اگر آپ نے ٹینک یا لائنوں سے اصل ایندھن کے رساؤ کی تصدیق کی ہے، تو انجن سٹارٹ کرنے کی کوشش نہ کریں - آگ لگنے کے شدید خطرے کی وجہ سے فوری طور پر پیشہ ورانہ روڈ سائیڈ اسسٹنس کو کال کریں۔"
        ],
        "Images": {
          "carFuelLeak": "assets/images/selfHelp/C_fuelleakage1.png",
          "carFuelLeak1": "assets/images/selfHelp/C_fuelleakage2.png",
          "carFuelLeak2": "assets/images/selfHelp/C_fuelleakage3.png",
          "carFuelLeak3": "assets/images/selfHelp/C_fuelleakage4.png",
          "carFuelLeak4": "assets/images/selfHelp/C_fuelleakage5.png",
          "carFuelLeak5": "assets/images/selfHelp/C_fuelleakage6.png",
          "carFuelLeak6": "assets/images/selfHelp/C_fuelleakage7.png"
        }
      },
      "In Bikes": {
        "Tools Required": [
          "1–2 لیٹر ایندھن کی بوتل",
          "چھوٹا فنیل",
          "ٹیپ (معمولی رساؤ کے لیے)"
        ],
        "Steps": [
          "جب آپ کی بائیک غیر متوقع طور پر رک جائے، تو پہلے تصدیق کریں کہ فیول ٹیپ ON یا RESERVE پوزیشن میں ہے، کیونکہ بعض اوقات مین ٹینک خالی ہوتا ہے لیکن ریزرو دستیاب رہتا ہے۔",
          "ٹینک سے کاربوریٹر تک فیول لائن کا احتیاط سے معائنہ کریں تاکہ دراڑیں، ٹوٹ پھوٹ یا ٹپکتے ایندھن کو تلاش کیا جا سکے، معمولی رساؤ کے لیے مضبوط ٹیپ کو عارضی سیل کے طور پر لگائیں۔",
          "اگر ٹینک واقعی خالی ہے، تو ایندھن کی نقل و حمل کے لیے خاص طور پر ڈیزائن کردہ ایک مناسب دھاتی یا سرٹیفائیڈ پلاسٹک کنٹینر میں تھوڑی مقدار میں ایندھن حاصل کریں۔",
          "چھلکنے سے بچنے کے لیے ایک چھوٹا فنیل استعمال کرتے ہوئے، ٹینک میں احتیاط سے ایندھن ڈالیں جب تک کہ یہ تقریباً تین چوتھائی بھر نہ جائے تاکہ پھیلنے کی گنجائش رہے۔",
          "فیول کیپ کو مضبوطی سے بند کریں اور بائیک کی سطح سے گرے ہوئے کسی بھی پیٹرول کو اچھی طرح صاف کریں، خاص طور پر انجن اور ایگزاسٹ کے علاقوں کے گرد۔",
          "مناسب دوبارہ بھرنے کے لیے قریب ترین پیٹرول اسٹیشن تک درمیانی رفتار سے احتیاط سے سواری کریں، پھر کسی بھی شناخت شدہ رساؤ پوائنٹس کی مستقل مرمت کے لیے مکینک سے ملیں۔"
        ],
        "Images": {
          "bikeFuelLeak1": "assets/images/selfHelp/B_fuelleakage1.png",
          "bikeFuelLeak2": "assets/images/selfHelp/B_fuelleakage2.png",
          "bikeFuelLeak3": "assets/images/selfHelp/B_fuelleakage3.png",
          "bikeFuelLeak4": "assets/images/selfHelp/B_fuelleakage4.png",
          "bikeFuelLeak5": "assets/images/selfHelp/B_fuelleakage5.png",
          "bikeFuelLeak6": "assets/images/selfHelp/B_fuelleakage6.png"
        }
      }
    },
    {
      "Name": "کلچ کی خرابی",
      "In Cars": {
        "Tools Required": [
          "بریک فلوئڈ (ہائیڈرولک سسٹمز کے لیے)",
          "بنیادی ٹول کٹ"
        ],
        "Steps": [
          "اگر کلچ پیڈل غیر معمولی طور پر نرم، سپنجی محسوس ہوتا ہے، یا اپنی معمول کی پوزیشن پر واپس نہیں آتا، تو فوری طور پر معائنہ کے لیے ایک محفوظ مقام پر گاڑی کھڑی کریں۔",
          "ڈیش بورڈ کے نیچے کلچ پیڈل میکانزم کے گرد اور انجن بے میں ہائیڈرولک فلوئڈ کے رساؤ کی نظر آنے والی علامات کی جانچ کریں جو سسٹم کی ناکامی کی نشاندہی کرتی ہے۔",
          "کلچ فلوئڈ ریزروائر (عام طور پر بریک ماسٹر سلنڈر کے قریب) کو تلاش کریں اور کم سے کم اور زیادہ سے زیادہ اشارے کے نشانات کے خلاف فلوئڈ کی سطح کو چیک کریں۔",
          "اگر ریزروائر کم ہے، تو اسے مناسب قسم کے بریک فلوئڈ سے احتیاط سے اوپر تک بھریں، ہائیڈرولک سسٹم میں ہوا کے بلبلے شامل نہ کرنے کا خیال رکھیں۔",
          "کیبل سے چلنے والے کلچ والی گاڑیوں کے لیے جہاں کیبل مکمل طور پر ٹوٹ گئی ہو، آپ عام طور پر گیئرز نہیں لگا سکتے اور پیشہ ورانہ ٹوئنگ سروس کی ضرورت ہوگی۔",
          "اگر فلوئڈ اوپر بھرنے کے بعد کلچ معمولی طور پر کام کرتا ہے، تو آپ کم سے کم کلچ کے استعمال کے ساتھ آہستہ سے گیئرز لگا سکتے ہیں اور قریب ترین مرمت کی سہولت تک آہستہ سے گاڑی چلا سکتے ہیں۔"
        ],
        "Images": {
          "carClutch1": "assets/images/selfHelp/C_clutchfailure1.png",
          "carClutch2": "assets/images/selfHelp/C_clutchfailure2.png",
          "carClutch3": "assets/images/selfHelp/C_clutchfailure3.png",
          "carClutch4": "assets/images/selfHelp/C_clutchfailure4.png",
          "carClutch5": "assets/images/selfHelp/C_clutchfailure5.png",
          "carClutch6": "assets/images/selfHelp/C_clutchfailure6.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "جب کلچ لیور ڈھیلا، سست محسوس ہوتا ہے، یا کلچ کو صحیح طریقے سے الگ کرنے میں ناکام رہتا ہے، تو سب سے پہلے کلچ کیبل کے کنکشن کو لیور اور انجن دونوں سروں پر چیک کریں۔",
          "کبھی کبھی کیبل کا سرا صرف اپنی برقرار رکھنے والی سلاٹ سے پھسل جاتا ہے - اگر کیبل برقرار ہے، تو اسے احتیاط سے صحیح پوزیشن میں دوبارہ داخل کریں اور تناؤ کو دوبارہ ایڈجسٹ کریں۔",
          "اگر کلچ کیبل مکمل طور پر ٹوٹ گئی ہے، تو اسے ایک اسپیئر کیبل سے تبدیل کریں (جو تجربہ کار سوار اکثر ساتھ رکھتے ہیں) اپنی بائیک کے مخصوص روٹنگ پیٹرن کی پیروی کرتے ہوئے۔",
          "اسپیئر کیبل کے بغیر، آپ بائیک کو نیوٹرل میں پش سٹارٹ کر سکتے ہیں، پھر انجن RPM کو روڈ کی رفتار سے میچ کرتے ہوئے کلچ کا استعمال کیے بغیر احتیاط سے گیئرز شفٹ کریں۔",
          "گیئر لیور پر ہلکا سا اوپر کی طرف دباؤ ڈالتے ہوئے اور تھروٹل کو لمحاتی طور پر پیچھے ہٹاتے ہوئے کلچ لیس شفٹنگ کی مشق کریں، پھر احتیاط سے مکینک کے پاس سواری کریں۔"
        ],
        "Images": {
          "bikeClutch1": "assets/images/selfHelp/B_clutchfailure1.png",
          "bikeClutch2": "assets/images/selfHelp/B_clutchfailure2.png",
          "bikeClutch3": "assets/images/selfHelp/B_clutchfailure3.png",
          "bikeClutch4": "assets/images/selfHelp/B_clutchfailure4.png",
          "bikeClutch5": "assets/images/selfHelp/B_clutchfailure5.png"
        }
      }
    },
    {
      "Name": "سٹارٹر موٹر کی ناکامی",
      "In Cars": {
        "Tools Required": [
          "ہتھوڑا یا رینچ (مارنے کے لیے)",
          "جمپر کیبلز"
        ],
        "Steps": [
          "جب اگنیشن کی کو موڑنے سے انجن کے کرینک ہونے کے بغیر صرف کلک کی آواز آتی ہے، تو پہلے ملٹی میٹر یا بصری اشاروں کا استعمال کرتے ہوئے اپنی بیٹری میں کافی چارج کی تصدیق کریں۔",
          "اگر بیٹری کی طاقت کافی ہونے کی تصدیق ہو جاتی ہے، تو مسئلہ غالباً ایک پھنسی ہوئی سٹارٹر موٹر کا ہے جو انجن کے فلائی وہیل کے دانتوں کے ساتھ صحیح طریقے سے نہیں جڑ رہی۔",
          "سٹارٹر موٹر کو تلاش کریں (عام طور پر انجن پر ٹرانسمیشن بیل ہاؤسنگ کے قریب نچلی طرف نصب ہوتی ہے) جو برقی کنکشن کے ساتھ ایک بیلناکار جزو ہے۔",
          "ایک اسسٹنٹ سے کہیں کہ وہ اگنیشن کی کو موڑے جبکہ آپ سٹارٹر موٹر کے باڈی کو ہتھوڑے یا رینچ سے آہستہ سے تھپتھپائیں - یہ وائبریشن پھنسے ہوئے اندرونی اجزاء کو آزاد کر سکتی ہے۔",
          "اگر تھپتھپانے سے کام نہیں ہوتا ہے، تو کسی دوسری گاڑی کے ساتھ جمپ سٹارٹ کرنے کی کوشش کریں تاکہ ایک کمزور بیٹری کی ناکافی کرینکنگ ایمپیریج فراہم کرنے کے امکان کو ختم کیا جا سکے۔",
          "جب یہ تمام اقدامات ناکام ہو جائیں، تو مزید کوششیں بند کر دیں تاکہ بیٹری کے مکمل ختم ہونے سے بچا جا سکے اور پیشہ ورانہ تشخیص اور ممکنہ ٹوئنگ کے لیے روڈ سائیڈ اسسٹنس سے رابطہ کریں۔"
        ],
        "Images": {
          "carStarter1": "assets/images/selfHelp/C_startermotor1.png",
          "carStarter2": "assets/images/selfHelp/C_startermotor2.png",
          "carStarter3": "assets/images/selfHelp/C_startermotor3.png",
          "carStarter4": "assets/images/selfHelp/C_startermotor4.png",
          "carStarter5": "assets/images/selfHelp/C_startermotor5.png",
          "carStarter6": "assets/images/selfHelp/C_startermotor6.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "اگر الیکٹرک سٹارٹر بٹن کوئی جواب نہیں دیتا، تو پہلے ملٹی میٹر سے بیٹری وولٹیج چیک کریں یا تصدیق کریں کہ دیگر برقی نظام عام طور پر کام کر رہے ہیں۔",
          "اگر آپ کی بائیک کک سٹارٹر سے لیس ہے تو اسے استعمال کریں - کامیابی سے کک سٹارٹ ہونے سے ایک برقی مسئلہ کی نشاندہی ہوتی ہے بجائے اس کے کہ کوئی میکانکی انجن کا مسئلہ ہو۔",
          "اگر کک سٹارٹر کام کرتا ہے لیکن الیکٹرک بٹن نہیں کرتا، تو سٹارٹر ریلے اور متعلقہ وائرنگ کنکشنز کو زنگ، نقصان، یا منقطع ہونے کے لیے معائنہ کریں۔",
          "میکانکی طور پر جام سٹارٹر موٹر کے لیے، بائیک کو دوسرے گیئر میں دوڑاتے ہوئے اور کودتے ہوئے اچانک کلچ چھوڑ کر پش سٹارٹ کرنے کی کوشش کریں۔",
          "اگر سٹارٹر موٹر کی جانچ یا خصوصیت والی جلنے والی بدبو کے ذریعے جلنے کی تصدیق ہو جاتی ہے، تو اسے موٹرسائیکل مرمت کی ورکشاپ میں پیشہ ورانہ تبدیلی کی ضرورت ہوتی ہے۔"
        ],
        "Images": {
          "bikeStarter1": "assets/images/selfHelp/B_startermotor1.png",
          "bikeStarter2": "assets/images/selfHelp/B_startermotor2.png",
          "bikeStarter3": "assets/images/selfHelp/B_startermotor3.png",
          "bikeStarter4": "assets/images/selfHelp/B_startermotor4.png",
          "bikeStarter5": "assets/images/selfHelp/B_startermotor5.png"
        }
      }
    },
    {
      "Name": "انڈیکیٹر کی ناکامی",
      "In Cars": {
        "Tools Required": [
          "اسپیئر بلب",
          "فیوز کٹ",
          "سکریو ڈرایور"
        ],
        "Steps": [
          "جب ہیڈلائٹس یا ٹرن سگنلز جیسے متعدد لائٹنگ اجزاء بیک وقت فیل ہو جائیں، تو یہ عام طور پر ایک اڑے ہوئے فیوز کی نشاندہی کرتا ہے جو پورے لائٹنگ سرکٹ کو متاثر کر رہا ہے۔",
          "لائٹنگ سسٹم کے فیوز پر مشتمل بنیادی فیوز باکس (عام طور پر ڈیش بورڈ کے نیچے یا انجن کے ڈبے میں) کو تلاش کرنے کے لیے اپنی گاڑی کے دستی سے مشورہ کریں۔",
          "ڈایاگرام کا استعمال کرتے ہوئے فیل شدہ لائٹس کے لیے مخصوص فیوز کی شناخت کریں، اسے احتیاط سے ہٹا دیں، اور مناسب تحفظ کے لیے اسی ایمپیریج ریٹڈ نئے فیوز سے تبدیل کریں۔",
          "اگر صرف ایک بلب فیل ہوا ہے، تو مناسب سکریو ڈرایورز کا استعمال کرتے ہوئے لائٹ اسمبلی کا کور احتیاط سے ہٹا دیں اور مخصوص جلے ہوئے بلب کو ایک مطابقت پذیر نئے بلب سے تبدیل کریں۔",
          "ڈھیلے کنکشنز یا قدرے کھلی وائرنگ کے لیے، ایک عارضی انسولیشن اقدام کے طور پر معیاری الیکٹریکل ٹیپ لگائیں جب تک کہ مناسب مرمت نہ کی جا سکے۔",
          "مستقل مرمت مکمل ہونے تک، ضرورت پڑنے پر ہیزرڈ لائٹس کا استعمال کریں اور اضافی احتیاط کے ساتھ ڈرائیو کریں، خاص طور پر کم مرئیت کے حالات یا رات کی ڈرائیونگ کے دوران۔"
        ],
        "Images": {
          "carHeadlight1": "assets/images/selfHelp/C_indicator1.png",
          "carHeadlight2": "assets/images/selfHelp/C_indicator2.png",
          "carHeadlight3": "assets/images/selfHelp/C_indicator3.png",
          "carHeadlight4": "assets/images/selfHelp/C_indicator4.png",
          "carHeadlight5": "assets/images/selfHelp/C_indicator5.png",
          "carHeadlight6": "assets/images/selfHelp/C_indicator6.png"
        }
      },
      "In Bikes": {
        "Steps": [
          "اگر آپ کی موٹرسائیکل کی ہیڈلائٹ روشن نہیں ہوتی، تو پہلے اپنی بائیک کے ڈیزائن کے مطابق ارد گرد کا کور یا بیزل ہٹا کر ہیڈلیمپ اسمبلی تک رسائی حاصل کریں۔",
          "اس کی برقرار رکھنے والی کلپ کو ہٹا کر یا گھڑی کی مخالف سمت میں موڑ کر پرانے بلب کو احتیاط سے ہٹا دیں، پھر شیشے کی سطح کو چھوئے بغیر ایک نیا مطابقت پذیر بلب لگائیں۔",
          "عام طور پر سیٹ کے نیچے یا بیٹری کے ڈبے کے قریب پائے جانے والے مین الیکٹریکل فیوز کو تلاش کریں اور معائنہ کریں، اگر اندرونی عنصر ٹوٹا ہوا نظر آتا ہے تو اسے تبدیل کریں۔",
          "ٹرن سگنل کی ناکامیوں کے لیے، فلیشر ریلے اور ہیڈلائٹ کیسنگ کے اندر تمام وائرنگ کنکشنز کو زنگ، ڈھیلا پن، یا منقطع ہونے کے مسائل کے لیے چیک کریں۔",
          "اگر فوری مرمت انجام دینے سے قاصر ہوں، تو موڑنے اور بریک لگانے کے لیے مناسب ہینڈ سگنلز کا استعمال کریں، اور رات کی سواری سے گریز کریں جب تک کہ تمام لائٹنگ سسٹمز مکمل طور پر فعال نہ ہو جائیں۔"
        ],
        "Images": {
          "bikeHeadlight1": "assets/images/selfHelp/B_indicator1.png",
          "bikeHeadlight2": "assets/images/selfHelp/B_indicator2.png",
          "bikeHeadlight3": "assets/images/selfHelp/B_indicator3.png",
          "bikeHeadlight4": "assets/images/selfHelp/B_indicator4.png",
          "bikeHeadlight5": "assets/images/selfHelp/B_indicator5.png"
        }
      }
    }
  ]
}